app/Http/Controllers/Front/Home_frontController.php

select * from `faqs` order by `order` asc
select * from `testimonials` where `status` = 1
select * from `menu_settings` where `parent_id` = 0
select * from `blogs` order by `id` desc limit 3
select * from `projects` order by `id` desc limit 2
select * from `projects` limit 1
select * from `projects` where `project_category` = 2 limit 1
---
    public function index()
    {

        $lang = UtilityFacades::getActiveLanguage();
        \App::setLocale($lang);
        $faqs = Faq::orderBy('order')->get();
        $features = json_decode(UtilityFacades::getsettings('feature_setting'));
        $testimonials = Testimonial::where('status', 1)->get();
        $appsMultipleImageSettings = json_decode(UtilityFacades::getsettings('apps_multiple_image_setting'));
        $footerMainMenus = MenuSetting::where('parent_id', 0)->get();
        $businessGrowthsViewSettings = json_decode(UtilityFacades::getsettings('business_growth_view_setting'));
        $businessGrowthsSettings = json_decode(UtilityFacades::getsettings('business_growth_setting'));
        $blogs = Blog::take(3)->orderby('id', 'desc')->get();
        $projects = Project::take(2)->orderby('id', 'desc')->get();
        $currentDate = now()->toDateString();
        $cover_project = Project::first();
        $clients = Client::all();
        $leaderships = Leadership::latest()->take(3)->get();
        $recentProjects    = Project::latest()->take(3)->get();
        $lastProject       = Project::latest()->first();
        $allProjects      = Project::with("category")->get();
        $categories = ProjectCategory::with('projects')->get();