app/Http/Controllers/Back/MenuController.php

    public function index()
    {

        $MainMenus = MenuSetting::where('parent_id', 0)->orderby('sort','desc')->get();
        foreach ($MainMenus as $key=>$record){
            $MainMenus[$key]['SubMenus'] = MenuSetting::where('parent_id', '=', $record['id'])->orderby('sort','desc')->get();
        }
        $pages = PageSetting::pluck('title', 'id');
---
select * from `menu_settings` where `parent_id` = 0 order by `sort` desc
select * from `menu_settings` where `parent_id` = 21 order by `sort` desc
select `title`, `id` from `page_settings`